export const reducedWeekDays = {
  понедельник: 'ПН',
  вторник: 'ВТ',
  среда: 'СР',
  четверг: 'ЧТ',
  пятница: 'ПТ',
  суббота: 'СБ',
  воскресенье: 'ВС',
};

export const dayNamesWithPreposition = {
  понедельник: 'понедельник',
  вторник: 'вторник',
  среда: 'среду',
  четверг: 'четверг',
  пятница: 'пятницу',
  суббота: 'субботу',
  воскресенье: 'воскресенье',
};

export const monthDeclensions = {
  январь: 'января',
  февраль: 'февраля',
  март: 'марта',
  апрель: 'апреля',
  май: 'мая',
  июнь: 'июня',
  июль: 'июля',
  август: 'августа',
  сентябрь: 'сентября',
  октябрь: 'октября',
  ноябрь: 'ноября',
  декабрь: 'декабря',
};

export const dateRegex = /^(0[1-9]|[12][0-9]|3[01])\.(0[1-9]|1[0-2])\.(\d{4})$/;
